Autodesk.Revit.DB.IFC.IFCProductWrapper.AddSite(Autodesk.Revit.DB.IFC.IFCAnyHandle)
Adds a site (IfcObject) handle to associate with the IfcProduct in this wrapper.
siteHandle:
The site handle.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.IFC.IFCProductWrapper.AddFinishMaterial(Autodesk.Revit.DB.IFC.IFCAnyHandle)
Adds a material handle to associate with the IfcProduct in this wrapper.
material:
The material handle.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.IFC.IFCProductWrapper.AddAnnotation(Autodesk.Revit.DB.IFC.IFCAnyHandle,Autodesk.Revit.DB.IFC.IFCLevelInfo,System.Boolean)
Adds an annotation handle to associate with the IfcProduct in this wrapper.
Remarks:
If the IFCLevelInfo is not provided, and relateToLevel to true, the handle will be associated to the building handle.
annoHnd:
The annotation handle.
levelInfo:
Information on the associated level.  Optional, can be null.
relateToLevel:
True to relate the annotation to the level, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.IFC.IFCProductWrapper.AddElement(Autodesk.Revit.DB.IFC.IFCAnyHandle,Autodesk.Revit.DB.IFC.IFCLevelInfo,Autodesk.Revit.DB.IFC.IFCExtrusionCreationData,System.Boolean)
Adds an IfcElement handle to associate with the IfcProduct in this wrapper.
Remarks:
If the IFCLevelInfo is not provided, and relateToLevel to true, the handle will be associated to the building handle.
elementHandle:
The IfcElement handle.
pLevelInfo:
The level info.
params:
The extrusion creation data associated with the given element.  Optional, can be null.
relateToLevel:
True to relate the element to the level, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.IFC.IFCProductWrapper.AddBuilding(Autodesk.Revit.DB.IFC.IFCAnyHandle)
Adds an IfcBuilding handle to associate with the IfcProduct in this wrapper.
buildingHandle:
The IfcBuilding handle.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.IFC.IFCProductWrapper.AddSpace(Autodesk.Revit.DB.IFC.IFCAnyHandle,Autodesk.Revit.DB.IFC.IFCLevelInfo,Autodesk.Revit.DB.IFC.IFCExtrusionCreationData,System.Boolean)
Adds an IfcSpace handle to associate with the IfcProduct in this wrapper.
Remarks:
If the IFCLevelInfo is not provided, and relateToLevel to true, the handle will be associated to the building handle.
spaceHandle:
The IfcSpace handle.
pLevelInfo:
Information on the associated level.
pParams:
The extrusion creation data associated with the given space.  Optional, can be null.
relateToLevel:
True to relate the space to the level, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.IFC.IFCProductWrapper.FindExtrusionCreationParameters(Autodesk.Revit.DB.IFC.IFCAnyHandle)
Obtains the extrusion creation data associated with the given element.
elementHandle:
The handle.
Returns:
The parameters. null if no parameters are associated with the element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.IFC.IFCProductWrapper.Create(Autodesk.Revit.DB.IFC.IFCProductWrapper,System.Boolean)
Establishes a new product manager for elements and objects derived from a parent product manager, allowing override of allowRelateToLevel
pProductWrapper:
The parent product manager.
allowRelateToLevel:
True to allow associated elements and objects to relate to a level, false to never allow such a
relationship.
Returns:
The new product manager.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.IFC.IFCProductWrapper.Create(Autodesk.Revit.DB.IFC.IFCProductWrapper)
Establishes a new product manager for elements and objects derived from a parent product manager.
pProductWrapper:
The parent product manager.
Returns:
The new product manager.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.IFC.IFCProductWrapper.Create(Autodesk.Revit.DB.IFC.ExporterIFC,System.Boolean)
Establishes a new baseline product manager for elements and objects.
Remarks:
Elements and objects associated to this product manager will be associated to a top-level IfcProduct based on the world coordinate
system of the output file.
ExporterIFC:
The exporter.
allowRelateToLevel:
True to allow associated elements and objects to relate to a level, false to never allow such a
relationship.
Returns:
The new baseline product manager.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012